# Manipulating Data

## Installing dependencies

In [1]:
!pip3 install pandas

Requirement already satisfied: pandas in c:\users\shash\appdata\local\programs\python\python36\lib\site-packages
Requirement already satisfied: numpy>=1.13.3 in c:\users\shash\appdata\local\programs\python\python36\lib\site-packages (from pandas)
Requirement already satisfied: pytz>=2017.2 in c:\users\shash\appdata\local\programs\python\python36\lib\site-packages (from pandas)
Requirement already satisfied: python-dateutil>=2.6.1 in c:\users\shash\appdata\local\programs\python\python36\lib\site-packages (from pandas)
Requirement already satisfied: six>=1.5 in c:\users\shash\appdata\local\programs\python\python36\lib\site-packages (from python-dateutil>=2.6.1->pandas)

You are using pip version 9.0.3, however version 20.2.2 is available.
You should consider upgrading via the 'python -m pip install --upgrade pip' command.

## Import Libraries

In [2]:
import pandas as pd
import os

## Creating data for examples

### Create empty dataframe

In [3]:
df = pd.DataFrame()

### Creating list for data for each row

NOTE: Each list denotes each row. All of them will have the same length

In [4]:
col1 = [1,2,3,4,5]
col2 = ['a', 'b', 'c', 'd', 'e']

### Add these values as columns

In [5]:
df['col1'] = col1
df['col2'] = col2
df

   col1 col2
0     1    a
1     2    b
2     3    c
3     4    d
4     5    e

We will use this data for all of our functions

## Performing transformations

### Changing datatype of a column

In [6]:
print(df.info())
print()
df['col1'] = df['col1'].astype(str)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    5 non-null      int64
 1   col2    5 non-null      object
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes
None

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    5 non-null      object
 1   col2    5 non-null      object
dtypes: object(2)
memory usage: 208.0+ bytes

Reverting the datatype

In [7]:
df['col1'] = df['col1'].astype(int)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    5 non-null      int32
 1   col2    5 non-null      object
dtypes: int32(1), object(1)
memory usage: 188.0+ bytes

### Combining two columns

In [8]:
df['col3'] = df['col1'].astype(str) + ' ' + df['col2']
df

   col1 col2 col3
0     1    a  1 a
1     2    b  2 b
2     3    c  3 c
3     4    d  4 d
4     5    e  5 e

### Finding sum, median, mean, max, min of a column

mean

In [9]:
df['col1'].mean()

3.0

median

In [10]:
df['col1'].median()

3.0

sum

In [11]:
df['col1'].sum()

15

max

In [12]:
df['col1'].max()

5

min

In [13]:
df['col1'].min()

1

### Element-wise math operation

In [14]:
df['col1'] * 2

0     2
1     4
2     6
3     8
4    10
Name: col1, dtype: int32

In [15]:
df['col1'] + 5

0     6
1     7
2     8
3     9
4    10
Name: col1, dtype: int32

In [16]:
df['col1'] ** 2

0     1
1     4
2     9
3    16
4    25
Name: col1, dtype: int32

In [17]:
df['col1'] + 2 * df['col1']

0     3
1     6
2     9
3    12
4    15
Name: col1, dtype: int32

### Using the apply function

Step 1: Create a function which works on a single value

In [18]:
def fun1(x):
    return 2*x

Step 2: call this function inside ".apply()" funtion

In [19]:
df['col4'] = df['col1'].apply(fun1)
df

   col1 col2 col3  col4
0     1    a  1 a     2
1     2    b  2 b     4
2     3    c  3 c     6
3     4    d  4 d     8
4     5    e  5 e    10

Another way to use apply function is to use lambda funtion. It allows for more flexibility as you can choose the desired parameters

In [20]:
df['col4'] = df['col1'].apply(lambda x: fun1(x))
df

   col1 col2 col3  col4
0     1    a  1 a     2
1     2    b  2 b     4
2     3    c  3 c     6
3     4    d  4 d     8
4     5    e  5 e    10

Apply function can be used on any data type

In [21]:
def fun2(x):
    return x + ' hello'

In [22]:
df['col5'] = df['col2'].apply(fun2)
df

   col1 col2 col3  col4     col5
0     1    a  1 a     2  a hello
1     2    b  2 b     4  b hello
2     3    c  3 c     6  c hello
3     4    d  4 d     8  d hello
4     5    e  5 e    10  e hello

### Selecting desired columns

In [23]:
df[['col1', 'col2']]

   col1 col2
0     1    a
1     2    b
2     3    c
3     4    d
4     5    e

### Dropping desired columns

In [24]:
df.drop(['col5'], axis=1)

   col1 col2 col3  col4
0     1    a  1 a     2
1     2    b  2 b     4
2     3    c  3 c     6
3     4    d  4 d     8
4     5    e  5 e    10

Axis = 1 will drop the column, axis = 0 will drop the row<br>
However, there is a better wat to drop rows

### Selecting desired rows

In [25]:
df[df['col1'] >= 3]

   col1 col2 col3  col4     col5
2     3    c  3 c     6  c hello
3     4    d  4 d     8  d hello
4     5    e  5 e    10  e hello

Using multiple statements

In [26]:
df[(df['col1'] >= 3) | (df['col2'] == 'a')]

   col1 col2 col3  col4     col5
0     1    a  1 a     2  a hello
2     3    c  3 c     6  c hello
3     4    d  4 d     8  d hello
4     5    e  5 e    10  e hello

### Changing the value in the dataframe

In [27]:
df.loc[df['col1'] == 3, 'col1'] = 33333
df

    col1 col2 col3  col4     col5
0      1    a  1 a     2  a hello
1      2    b  2 b     4  b hello
2  33333    c  3 c     6  c hello
3      4    d  4 d     8  d hello
4      5    e  5 e    10  e hello

### Obtaining a random sample of the data

"frac" stands for fraction

In [28]:
df.sample(frac=0.2)

    col1 col2 col3  col4     col5
2  33333    c  3 c     6  c hello

### find unique values of a column

In [29]:
df['col1'].unique()

array([    1,     2, 33333,     4,     5])